Repository: xfce-mirror/xfce4-weather-plugin
Catalog: po/*.po
Languages: kk, vi

source: Humidity is defined as the amount of water vapor in the air and increases the possibility of precipitation, fog and dew. While absolute humidity is the water content of air, relative humidity gives (in %) the current absolute humidity relative to the maximum for that air temperature and pressure.
kk: Ылғалдылық ауадағы су буының мөлшері ретінде анықталады және жауын-шашын, тұман мен шықтың түсу мүмкіндігін арттырады. Абсолюттік ылғалдылық ауадағы судың мөлшері болса, салыстырмалы ылғалдылық (пайызбен) сол ауа температурасы мен қысымы үшін мүмкін болатын ең жоғары мәнге қатысты ағымдағы абсолюттік ылғалдылықты көрсетеді.
vi: Độ ẩm được định nghĩa là lượng hơi nước trong không khí và làm tăng khả năng xảy ra mưa, sương mù và sương. Trong khi độ ẩm tuyệt đối là hàm lượng nước trong không khí, thì độ ẩm tương đối mang lại (tính theo%) độ ẩm tuyệt đối hiện tại so với mức tối đa đối với nhiệt độ và áp suất không khí đó.

source: This is the temperature to which air must be cooled to reach 100% relative humidity, given no change in water content. Reaching the dew point halts the cooling process, as condensation occurs which releases heat into the air. A high dew point increases the possibility of rain and severe thunderstorms. The dew point allows the prediction of dew, frost, fog and minimum overnight temperature, and has influence on the comfort level one experiences. <b>Note:</b> This is a calculated value not provided by met.no.
kk: Бұл — су мөлшері өзгермеген жағдайда, ауа 100% салыстырмалы ылғалдылыққа жету үшін суытылуы тиіс температура. Шық нүктесіне жеткенде суыту процесі тоқтайды, өйткені ауаға жылу бөлетін конденсация жүреді. Шық нүктесінің жоғары болуы жаңбыр мен қатты найзағайдың ықтималдығын арттырады. Шық нүктесі шық, қыров, тұман мен түндегі ең төменгі температураны болжауға мүмкіндік береді және адамның өзін сезіну деңгейіне әсер етеді. <b>Ескертпе:</b> Бұл — met.no ұсынбаған, есептелген мән.
vi: Đây là nhiệt độ mà không khí phải được làm mát để đạt độ ẩm tương đối 100%, trong điều kiện hàm lượng nước không thay đổi. Việc đạt đến điểm sương sẽ tạm dừng quá trình làm mát vì xảy ra hiện tượng ngưng tụ và giải Viceng nhiệt vào không khí. Điểm sương cao làm tăng khả năng xảy ra mưa và giông bão dữ dội. Điểm sương cho phép dự đoán sương, sương giá, sương mù và nhiệt độ tối thiểu qua đêm, đồng thời có ảnh hưởng đến mức độ thoải mái mà một người trải nghiệm. <b>Lưu ý:</b> Đây là giá trị được tính toán không được met.no cung cấp.

source: Also known as <i>felt temperature</i>, <i>effective temperature</i>, or what some weather providers declare as <i>feels like</i>. Human temperature sensation is not only based on air temperature, but also on heat flow, physical activity and individual condition. While being a highly subjective value, apparent temperature can actually be useful for warning about extreme conditions (cold, heat). <b>Note:</b> This is a calculated value not provided by met.no. You should use a calculation model appropriate for your local climate and personal preferences on the units page.
kk: Сондай-ақ <i>сезілетін температура</i>, <i>тиімді температура</i> немесе кейбір ауа райы провайдерлері <i>сезілуі</i> деп атайтын мән ретінде белгілі. Адамның температураны сезінуі тек ауа температурасына ғана емес, сонымен қатар жылу ағынына, физикалық белсенділікке және жеке күйіне байланысты. Өте субъективті мән болғанымен, сезілетін температура экстремалды жағдайлар (суық, ыстық) туралы ескерту үшін пайдалы болуы мүмкін. <b>Ескертпе:</b> Бұл — met.no ұсынбаған, есептелген мән. Бірліктер бетінде жергілікті климатыңыз бен жеке қалауларыңызға сәйкес келетін есептеу моделін пайдалануыңыз керек.
vi: Còn được gọi là <i>nhiệt độ cảm nhận được</i>, <i>nhiệt độ hiệu quả</i> hoặc giá trị mà một số nhà cung cấp dịch vụ thời tiết tuyên bố là <i>cảm giác như thế</i>. Cảm giác nhiệt độ của con người không chỉ dựa trên nhiệt độ không khí mà còn dựa trên dòng nhiệt, hoạt động thể chất và tình trạng cá nhân. Mặc dù là một giá trị mang tính chủ quan cao nhưng nhiệt độ biểu kiến ​​thực sự có thể hữu ích trong việc cảnh báo về các điều kiện khắc nghiệt (lạnh, nóng). <b>Lưu ý:</b> Đây là giá trị được tính toán không được met.no cung cấp. Bạn nên sử dụng mô hình tính toán phù hợp với khí hậu địa phương và sở thích cá nhân trên trang đơn vị.

source: This gives the low-level cloud cover in percent. According to WMO definition, low-level clouds can be found at altitudes below 4,000 m (13,000 ft), or 5,000 m (16,000 ft) at the equator, though their basis often lie below 2,000 m (6,500 ft). They are mainly composed of water droplets or ice particles and snow, when temperatures are cold enough.
kk: Бұл төменгі деңгейдегі бұлттылықты пайызбен көрсетеді. Дмұ анықтамасына сәйкес, төменгі деңгейдегі бұлттар 4 000 м (13 000 фут) төмен биіктікте немесе экваторда 5 000 м (16 000 фут) биіктікте кездеседі, бірақ олардың негізі жиі 2 000 м (6 500 фут) төмен жатады. Олар негізінен су тамшыларынан немесе температура жеткілікті төмен болғанда мұз бөлшектері мен қардан тұрады.
vi: Điều này mang lại độ che phủ của đám mây cấp thấp tính bằng phần trăm. Theo định nghĩa của WMO, các đám mây ở tầng thấp có thể được tìm thấy ở độ cao dưới 4.000 m (13.000 ft) hoặc 5.000 m (16.000 ft) ở xích đạo, mặc dù nền của chúng thường nằm dưới 2.000 m (6.500 ft). Chúng chủ yếu bao gồm những giọt nước hoặc hạt băng và tuyết khi nhiệt độ đủ lạnh.

source: This specifies the mid-level cloud cover in percent. According to WMO definition, mid-level clouds form in heights of 4,000-8,000 m (13,000-26,000 ft), or 5,000-10,000 m (16,000-33,000 ft) at the equator. Like their low-level cousins, they are principally composed of water droplets. When temperatures get low enough, ice particles can replace the droplets.
kk: Бұл орта деңгейдегі бұлттылықты пайызбен көрсетеді. Дмұ анықтамасына сәйкес, орта деңгейдегі бұлттар 4 000-8 000 м (13 000-26 000 фут) биіктікте немесе экваторда 5 000-10 000 м (16 000-33 000 фут) биіктікте түзіледі. Төменгі деңгейдегі тектестері сияқты, олар негізінен су тамшыларынан тұрады. Температура жеткілікті төмендегенде, мұз бөлшектері тамшыларды алмастыра алады.
vi: Điều này chỉ định độ che phủ của đám mây ở mức trung bình theo phần trăm. Theo định nghĩa của WMO, các đám mây trung bình hình thành ở độ cao 4.000-8.000 m (13.000-26.000 ft) hoặc 5.000-10.000 m (16.000-33.000 ft) tại xích đạo. Giống như những người anh em họ cấp thấp của chúng, chúng chủ yếu được cấu tạo từ những giọt nước. Khi nhiệt độ xuống đủ thấp, các hạt băng có thể thay thế các giọt nước.

source: This reports the high-level cloud cover in percent. According to WMO definition, high-level clouds can be found in altitudes of 8,000 to 15,000 m (26,000 to 49,000 ft), or 10,000 m-18,000 m (33,000-59,000 ft) at the equator, where temperatures are so low that they are mainly composed of ice crystals. While typically thin and white in appearance, they can be seen in a magnificent array of colors when the sun is low on the horizon.
kk: Бұл жоғарғы деңгейдегі бұлттылықты пайызбен хабарлайды. Дмұ анықтамасына сәйкес, жоғарғы деңгейдегі бұлттар 8 000-нан 15 000 м-ге дейінгі (26 000 - 49 000 фут) биіктікте немесе экваторда 10 000 м-18 000 м (33 000-59 000 фут) биіктікте кездеседі, онда температура өте төмен болғандықтан, олар негізінен мұз кристалдарынан тұрады. Әдетте жұқа және ақ болып көрінгенімен, күн көжиекте төмен болғанда, оларды түстердің керемет массивінен көруге болады.
vi: Điều này báo cáo độ che phủ của đám mây cấp cao tính bằng phần trăm. Theo định nghĩa của WMO, các đám mây tầng cao có thể được tìm thấy ở độ cao từ 8.000 đến 15.000 m (26.000 đến 49.000 ft) hoặc 10.000 m-18.000 m (33.000-59.000 ft) tại xích đạo, nơi nhiệt độ thấp đến mức chúng chủ yếu bao gồm các tinh thể băng. Mặc dù có vẻ ngoài mỏng và trắng, nhưng chúng có thể được nhìn thấy với nhiều màu sắc tuyệt đẹp khi mặt trời lặn ở đường chân trời.

source: Cloudiness, or cloud cover, defines the fraction of the sky obscured by clouds when observed from a given location. Clouds are both carriers of precipitation and regulator to the amount of solar radiation that reaches the surface. While during daytime they reduce the temperature, at night they have the opposite effect, as water vapor prevents long-wave radiation from escaping into space. Apart from that, clouds reflect light to space and in that way contribute to the cooling of the planet.
kk: Бұлттылық немесе бұлт қабаты белгілі бір жерден бақылағанда бұлттармен көлегейленген аспан бөлігін анықтайды. Бұлттар жауын-шашын тасымалдаушы да, жер бетіне жететін күн радиациясының мөлшерін реттеуші де болып табылады. Күндіз олар температураны төмендетсе, түнде кері әсер береді, өйткені су буы ұзын толқынды радиацияның ғарышқа шығып кетуіне жол бермейді. Сонымен қатар, бұлттар жарықты ғарышқа шағылыстырады және осылайша планетаның салқындауына ықпал етеді.
vi: Độ mây hay độ che phủ của mây xác định phần bầu trời bị mây che khuất khi quan sát từ một vị trí nhất định. Các đám mây vừa là vật mang mưa vừa là vật điều chỉnh lượng bức xạ mặt trời chiếu tới bề mặt. Trong khi ban ngày chúng làm giảm nhiệt độ thì vào ban đêm chúng lại có tác dụng ngược lại, vì hơi nước ngăn cản bức xạ sóng dài thoát ra ngoài không gian. Ngoài ra, các đám mây phản chiếu ánh sáng vào không gian và theo cách đó góp phần làm mát hành tinh.

source: Fog is a type of low-lying stratus cloud, with the moisture in it often generated locally such as from a nearby lake, river, ocean, or simply moist ground, that forms when the difference between temperature and dew point is below 2.5 °C (4 °F), usually at a relative humidity of 100%. Fog commonly produces precipitation in the form of drizzle or very light snow and reduces visibility to less than 1 km (5/8 statute mile).
kk: Тұман — бұл төмен орналасқан қабатты бұлттардың түрі, оның құрамындағы ылғал жиі жергілікті жерде, мысалы, жақын маңдағы көлден, өзеннен, мұхиттан немесе жай ғана дымқыл жерден пайда болады; ол температура мен шық нүктесінің айырмашылығы 2,5 °C (4 °F) төмен болғанда, әдетте 100% салыстырмалы ылғалдылықта түзіледі. Тұман әдетте сіркіреген жаңбыр немесе өте жеңіл қар түріндегі жауын-шашынды тудырады және көріну қашықтығын 1 км-ден (5/8 миль) азға дейін төмендетеді.
vi: Sương mù là một loại đám mây tầng thấp, với độ ẩm thường được tạo ra cục bộ như từ hồ, sông, đại dương gần đó hoặc đơn giản là đất ẩm, hình thành khi chênh lệch giữa nhiệt độ và điểm sương dưới 2,5 °C (4 °F), thường ở độ ẩm tương đối 100%. Sương mù thường tạo ra lượng mưa dưới dạng mưa phùn hoặc tuyết rất nhẹ và làm giảm tầm nhìn xuống dưới 1 km (5/8 dặm quy định).

source: The amount of rain, drizzle, sleet, hail, snow, graupel and other forms of water falling from the sky over a specific period. The values reported by met.no are those of precipitation in the liquid state - or in other words: of rain -, so if snow is expected (but not sleet), then the amount of snow will be <i>guessed</i> by multiplying the original value by a ratio dependent on the air temperature: <tt><small> T &lt; -11.1 °C (12 °F) =&gt; 1:12 -11.1 °C (12 °F) &lt; T &lt; -4.4 °C (24 °F) =&gt; 1:10 -4.4 °C (24 °F) &lt; T &lt; -2.2 °C (28° F) =&gt; 1:7 -2.2 °C (28 °F) &lt; T &lt; -0.6 °C (31 °F) =&gt; 1:5 -0.6 °C (31 °F) &lt; T =&gt; 1:3 </small></tt>Example: If temperature is -5 °C (12 °F), then snow density will be low and a rain to snow ratio of 1:10 will be used for calculation. Assuming the reported value is 5 mm, then the calculated amount of snow precipitation is 50 mm. <b>Note</b>: While air temperature is an important factor in this calculation, there are other influencing factors that the plugin doesn't know about like the type of snow and ground temperature. Because of that, these rules will only lead to rough estimates and may not represent the real amount of snow.
kk: Белгілі бір кезеңде аспаннан түсетін жаңбыр, сіркіреген жаңбыр, мұзды жаңбыр, бұршақ, қар, мұзды жарма және басқа да су түрлерінің мөлшері. met.no хабарлайтын мәндер сұйық күйдегі жауын-шашын — басқаша айтқанда: жаңбыр — мәндері болып табылады, сондықтан егер қар күтілсе (бірақ мұзды жаңбыр емес), онда қар мөлшері бастапқы мәнді ауа температурасына байланысты коэффициентке көбейту арқылы <i>болжанады</i>: <tt><small> T &lt; -11.1 °C (12 °F) =&gt; 1:12 -11.1 °C (12 °F) &lt; T &lt; -4.4 °C (24 °F) =&gt; 1:10 -4.4 °C (24 °F) &lt; T &lt; -2.2 °C (28° F) =&gt; 1:7 -2.2 °C (28 °F) &lt; T &lt; -0.6 °C (31 °F) =&gt; 1:5 -0.6 °C (31 °F) &lt; T =&gt; 1:3 </small></tt>Мысалы: егер температура -5 °C (12 °F) болса, онда қардың тығыздығы төмен болады және есептеу үшін 1:10 жаңбыр мен қардың арақатынасы қолданылады. Хабарланған мән 5 мм деп алсақ, онда есептелген қар жауын-шашынының мөлшері 50 мм болады. <b>Ескертпе</b>: Бұл есептеуде ауа температурасы маңызды фактор болғанымен, плагинге белгісіз басқа да әсер етуші факторлар бар, мысалы, қардың түрі мен жердің температурасы. Соған байланысты бұл ережелер тек шамамен алынған бағалауларға әкеледі және қардың нақты мөлшерін көрсетпеуі мүмкін.
vi: Lượng mưa, mưa phùn, mưa tuyết, mưa đá, tuyết, mưa đá và các dạng nước khác từ trên trời rơi xuống trong một khoảng thời gian cụ thể. Các giá trị được báo cáo bởi met.no là giá trị lượng mưa ở trạng thái lỏng - hay nói cách khác: mưa -, vì vậy nếu dự kiến sẽ có tuyết (nhưng không phải mưa đá), thì lượng tuyết sẽ được <i>đoán</i> bằng cách nhân giá trị ban đầu với tỷ lệ phụ thuộc vào nhiệt độ không khí: <tt><small> T &lt; -11,1 °C (12 °F) =&gt; 1:12 -11,1 °C (12 °F) &lt; T &lt; -4,4 °C (24 °F) =&gt; 1:10 -4,4 °C (24 °F) &lt; T &lt; -2,2 °C (28°F) =&gt; 1:7 -2,2 °C (28 °F) &lt; T &lt; -0,6 °C (31 °F) =&gt; 1:5 -0,6 °C (31 °F) &lt; T =&gt; 1:3 </small></tt>Ví dụ: Nếu nhiệt độ là -5 °C (12 °F), thì mật độ tuyết sẽ thấp và tỷ lệ mưa trên tuyết là 1:10 sẽ được sử dụng để tính toán. Giả sử giá trị được báo cáo là 5 mm thì lượng mưa tuyết được tính toán là 50 mm. <b>Lưu ý</b>: Mặc dù nhiệt độ không khí là một yếu tố quan trọng trong tính toán này nhưng có những yếu tố ảnh hưởng khác mà plugin không biết như loại tuyết và nhiệt độ mặt đất. Do đó, những quy tắc này sẽ chỉ đưa ra ước tính sơ bộ và có thể không thể hiện lượng tuyết thực sự.

source: Labels to d_isplay
kk: Көр_сетілетін белгілер
vi: Nhãn cho d_isplay

source: North
kk: Солтүстік
vi: Phía bắc

source: N
kk: С

source: North-East
kk: Солтүстік-Шығыс

source: NE
kk: СШ

source: East
kk: Шығыс
vi: Phía đông

source: E
kk: Ш

source: South-East
kk: Оңтүстік-Шығыс

source: SE
kk: ОШ

source: South
kk: Оңтүстік
vi: Phía nam

source: S
kk: О

source: South-West
kk: Оңтүстік-Батыс

source: SW
kk: ОБ

source: West
kk: Батыс
vi: Tây

source: W
kk: Б

source: North-West
kk: Солтүстік-Батыс

source: NW
kk: СБ

source: ft
kk: фут

source: m
kk: м
vi: tôi

source: hPa
kk: гПа

source: inHg
kk: сын.бағ.дюйм

source: mmHg
kk: мм сын. бағ.

source: km/h
kk: км/сағ

source: mph
kk: миля/сағ

source: m/s
kk: м/с
vi: bệnh đa xơ cứng

source: ft/s
kk: фут/с

source: kt
kk: уз

source: in
kk: дюйм
vi: tRONG

source: mm
kk: мм

source: Results
kk: Нәтижелер
vi: Kết quả

source: Searching...
kk: Іздеу...
vi: Đang tìm kiếm...

source: Search location
kk: Орналасуды іздеу
vi: Tìm kiếm vị trí

source: Cancel
kk: Бас тарту
vi: Hủy bỏ

source: OK
kk: ОК

source: Enter a city name or address
kk: Қала атын немесе адресті енгізіңіз
vi: Nhập tên thành phố hoặc địa chỉ

source: Search
kk: Іздеу
vi: Tìm kiếm

source: Unnamed place
kk: Атаусыз орналасу
vi: Địa điểm không tên

source: Coordinates
kk: Координаттар
vi: Tọa độ

source: Altitude
kk: Биіктік
vi: Độ cao

source: Latitude
kk: Ендік
vi: Vĩ độ

source: Longitude
kk: Бойлық
vi: Kinh độ

source: Downloads
kk: Жүктемелер
vi: Tải xuống

source: Weather data: Last: %s Next: %s Current failed attempts: %d
kk: Ауа райы деректері: Соңғы: %s Келесі: %s Қазіргі сәтсіз әрекеттер саны: %d
vi: Dữ liệu thời tiết: Cuối cùng: %s Tiếp theo: %s Lần thử thất bại hiện tại: %d

source: Met.no Locationforecast API states that this version of the webservice is deprecated, and the plugin needs to be adapted to use a newer version, or it will stop working within a few months. Please file a bug on https://gitlab.xfce.org/panel-plugins/xfce4-weather-plugin/ if no one else has done so yet.
kk: Met.no Locationforecast API бұл веб-қызмет нұсқасы ескіргенін және плагинді жаңа нұсқаны пайдалану үшін бейімдеу керектігін хабарлайды, әйтпесе ол бірнеше айдың ішінде жұмысын тоқтатады. Егер әлі ешкім жасамаған болса, келесі сілтеме бойынша қате туралы хабарлама қалдырыңыз: https://gitlab.xfce.org/panel-plugins/xfce4-weather-plugin/
vi: Met.no API dự báo vị trí cho biết phiên bản này của dịch vụ web không được dùng nữa và plugin cần phải được thích nghi để sử dụng phiên bản mới hơn, nếu không nó sẽ ngừng hoạt động trong vòng một vài tháng. Vui lòng gửi lỗi trên https://gitlab.xfce.org/panel-plugins/xfce4-weather-plugin/ nếu chưa có ai khác làm như vậy.

source: Astronomical data: Last: %s Next: %s Current failed attempts: %d
kk: Астрономиялық деректер: Соңғы: %s Келесі: %s Қазіргі сәтсіз әрекеттер саны: %d
vi: Dữ liệu thiên văn: Cuối cùng: %s Tiếp theo: %s Lần thử thất bại hiện tại: %d

source: Met.no sunrise API states that this version of the webservice is deprecated, and the plugin needs to be adapted to use a newer version, or it will stop working within a few months. Please file a bug on https://gitlab.xfce.org/panel-plugins/xfce4-weather-plugin/ if no one else has done so yet.
kk: Met.no sunrise API бұл веб-қызмет нұсқасы ескіргенін және плагинді жаңа нұсқаны пайдалану үшін бейімдеу керектігін хабарлайды, әйтпесе ол бірнеше айдың ішінде жұмысын тоқтатады. Егер әлі ешкім жасамаған болса, келесі сілтеме бойынша қате туралы хабарлама қалдырыңыз: https://gitlab.xfce.org/panel-plugins/xfce4-weather-plugin/
vi: Met.no API mặt trời mọc cho biết phiên bản dịch vụ web này không được dùng nữa và plugin cần được điều chỉnh để sử dụng phiên bản mới hơn, nếu không nó sẽ ngừng hoạt động trong vòng vài tháng. Vui lòng gửi lỗi trên https://gitlab.xfce.org/panel-plugins/xfce4-weather-plugin/ nếu chưa có ai khác làm như vậy.

source: Times Used for Calculations
kk: Есептеулер үшін пайдаланылған уақыт
vi: Thời gian được sử dụng để tính toán

source: Temperatures, wind, atmosphere and cloud data calculated for: %s
kk: Температура, жел, атмосфера және бұлттылық деректері келесіге есептелген: %s
vi: Dữ liệu nhiệt độ, gió, khí quyển và đám mây được tính toán cho: %s

source: Precipitation and the weather symbol have been calculated using the following time interval: Start: %s End: %s
kk: Жауын-шашын және ауа райы таңбасы келесі уақыт аралығы үшін есептелген: Басы: %s Соңы: %s
vi: Lượng mưa và biểu tượng thời tiết đã được tính toán sử dụng khoảng thời gian sau: Bắt đầu: %s Kết thúc: %s

source: Astronomical Data
kk: Астрономиялық деректер
vi: Dữ liệu thiên văn

source: Sunrise: The sun never rises today.
kk: Күннің шығуы: Бүгін күн шықпайды.
vi: Bình minh: Hôm nay mặt trời không bao giờ mọc.

source: Sunset: The sun never sets today.
kk: Күннің батуы: Бүгін күн батпайды.
vi: Hoàng hôn: Hôm nay mặt trời không bao giờ lặn.

source: Sunrise: %s
kk: Күннің шығуы: %s
vi: Bình minh: %s

source: Sunset: %s
kk: Күннің батуы: %s
vi: Hoàng hôn: %s

source: Moon phase: %s
kk: Ай фазасы: %s
vi: Pha mặt trăng: %s

source: Moon phase: Unknown
kk: Ай фазасы: Белгісіз
vi: Giai đoạn mặt trăng: Không xác định

source: Moonrise: The moon never rises today.
kk: Айдың шығуы: Бүгін ай шықпайды.
vi: Moonrise: Hôm nay mặt trăng không bao giờ mọc.

source: Moonset: The moon never sets today.
kk: Айдың батуы: Бүгін ай батпайды.
vi: Trăng lặn: Hôm nay mặt trăng không bao giờ lặn.

source: Moonrise: %s
kk: Айдың шығуы: %s
vi: Trăng mọc: %s

source: Moonset: %s
kk: Айдың батуы: %s
vi: Trăng lặn: %s

source: Data not available, will use sane default values for night and day.
kk: Деректер қолжетімсіз, түн мен күн үшін қолайлы әдепкі мәндер пайдаланылады.
vi: Dữ liệu không có sẵn, sẽ sử dụng các giá trị mặc định lành mạnh cho ngày và đêm.

source: Temperatures
kk: Температуралар
vi: Nhiệt độ

source: Temperature
kk: Температура
vi: Nhiệt độ

source: Dew point
kk: Шық нүктесі
vi: Điểm sương

source: Apparent temperature
kk: Сезілетін температура
vi: Nhiệt độ biểu kiến

source: Wind
kk: Жел
vi: Gió

source: Speed: %s %s (%s on the Beaufort scale)
kk: Жылдамдығы: %s %s (Бофорт шкаласы бойынша %s)
vi: Tốc độ: %s %s (%s trên thang đo Beaufort)

source: Direction: %s (%s%s)
kk: Бағыты: %s (%s%s)
vi: Phương hướng: %s (%s%s)

source: Precipitation
kk: Жауын-шашын
vi: Sự kết tủa

source: Precipitation amount
kk: Жауын-шашын мөлшері
vi: Lượng mưa

source: Atmosphere
kk: Атмосфера
vi: Bầu không khí

source: Barometric pressure
kk: Барометрлік қысым
vi: Áp suất khí quyển

source: Relative humidity
kk: Салыстырмалы ылғалдылық
vi: Độ ẩm tương đối

source: Clouds
kk: Бұлттар
vi: Mây

source: Fog
kk: Тұман
vi: Sương mù

source: Low clouds
kk: Аздаған бұлттылық
vi: Mây thấp

source: Middle clouds
kk: Орташа бұлттылық
vi: Mây giữa

source: High clouds
kk: Жоғарғы бұлттылық
vi: Mây cao

source: Cloudiness
kk: Бұлттылық
vi: Mây

source: Credits
kk: Алғыстар
vi: Tín dụng

source: Encyclopedic information partly taken from
kk: Энциклопедиялық ақпарат ішінара келесіден алынған
vi: Thông tin bách khoa một phần được lấy từ

source: Wikipedia
kk: Википедия

source: Elevation and timezone data provided by
kk: Биіктік және уақыт белдеуі деректерін ұсынған
vi: Dữ liệu độ cao và múi giờ được cung cấp bởi

source: Weather and astronomical data from
kk: Ауа райы және астрономиялық деректер көзі:
vi: Dữ liệu thời tiết và thiên văn từ

source: The Norwegian Meteorological Institute
kk: Норвегия метеорология институты
vi: Viện Khí tượng Na Uy

source: Today
kk: Бүгін
vi: Hôm nay

source: Tomorrow
kk: Ертең
vi: Ngày mai

source: <b>Times used for calculations</b>
kk: <b>Есептеулер үшін пайдаланылған уақыт</b>
vi: <b>Thời gian dùng để tính toán</b>

source: <tt><small>Interval start: %s</small></tt>
kk: <tt><small>Аралықтың басы: %s</small></tt>
vi: <tt><small>Bắt đầu khoảng thời gian: %s</small></tt>

source: <tt><small>Interval end: %s</small></tt>
kk: <tt><small>Аралықтың соңы: %s</small></tt>
vi: <tt><small>Kết thúc quãng: %s</small></tt>

source: <tt><small>Data calculated for: %s</small></tt>
kk: <tt><small>Мәліметтер есептелген уақыты: %s</small></tt>
vi: <tt><small>Dữ liệu được tính cho: %s</small></tt>

source: <b>Temperatures</b>
kk: <b>Температуралар</b>
vi: <b>Nhiệt độ</b>

source: <tt><small>Dew point: %s%s%s</small></tt>
kk: <tt><small>Шық нүктесі: %s%s%s</small></tt>
vi: <tt><small>Điểm sương: %s%s%s</small></tt>

source: <tt><small>Apparent temperature: %s%s%s</small></tt>
kk: <tt><small>Сезілетін температура: %s%s%s</small></tt>
vi: <tt><small>Nhiệt độ biểu kiến: %s%s%s</small></tt>

source: <b>Atmosphere</b>
kk: <b>Атмосфера</b>
vi: <b>Bầu không khí</b>

source: <tt><small>Barometric pressure: %s%s%s</small></tt>
kk: <tt><small>Барометрлік қысым: %s%s%s</small></tt>
vi: <tt><small>Áp suất khí quyển: %s%s%s</small></tt>

source: <tt><small>Relative humidity: %s%s%s</small></tt>
kk: <tt><small>Салыстырмалы ылғалдылық: %s%s%s</small></tt>
vi: <tt><small>Độ ẩm tương đối: %s%s%s</small></tt>

source: <b>Precipitation</b>
kk: <b>Жауын-шашын</b>
vi: <b>Lượng mưa</b>

source: <tt><small>Amount: %s%s%s</small></tt>
kk: <tt><small>Мөлшері: %s%s%s</small></tt>
vi: <tt><small>Số tiền: %s%s%s</small></tt>

source: <b>Clouds</b>
kk: <b>Бұлттар</b>
vi: <b>Mây</b>

source: <tt><small>Fog: %5s%s%s</small></tt>
kk: <tt><small>Тұман: %5s%s%s</small></tt>
vi: <tt><small>Sương mù: %5s%s%s</small></tt>

source: <tt><small>Low clouds: %5s%s%s</small></tt>
kk: <tt><small>Аздаған бұлттылық: %5s%s%s</small></tt>
vi: <tt><small>Mây thấp: %5s%s%s</small></tt>

source: <tt><small>Middle clouds: %5s%s%s</small></tt>
kk: <tt><small>Орташа бұлттылық: %5s%s%s</small></tt>
vi: <tt><small>Mây ở giữa: %5s%s%s</small></tt>
