Repository: xfce-mirror/xfce4-weather-plugin
Catalog: po/*.po
Languages: kk, vi

source: <tt><small>High clouds: %5s%s%s</small></tt>
kk: <tt><small>Жоғары бұлттылық: %5s%s%s</small></tt>
vi: <tt><small>Mây cao: %5s%s%s</small></tt>

source: <tt><small>Cloudiness: %5s%s%s</small></tt>
kk: <tt><small>Бұлттылық: %5s%s%s</small></tt>
vi: <tt><small>Mây: %5s%s%s</small></tt>

source: <tt><small>Sunrise: The sun never rises this day.</small></tt>
kk: <tt><small>Күннің шығуы: Бұл күні күн шықпайды.</small></tt>
vi: <tt><small>Mặt trời mọc: Mặt trời không bao giờ mọc vào ngày này.</small></tt>

source: <tt><small>Sunset: The sun never sets this day.</small></tt>
kk: <tt><small>Күннің батуы: Бұл күні күн батпайды.</small></tt>
vi: <tt><small>Hoàng hôn: Mặt trời không bao giờ lặn vào ngày này.</small></tt>

source: <tt><small>Sunrise: %s</small></tt>
kk: <tt><small>Күннің шығуы: %s</small></tt>
vi: <tt><small>Mặt trời mọc: %s</small></tt>

source: <tt><small>Sunset: %s</small></tt>
kk: <tt><small>Күннің батуы: %s</small></tt>
vi: <tt><small>Hoàng hôn: %s</small></tt>

source: <tt><small>Moon phase: %s</small></tt>
kk: <tt><small>Ай фазасы: %s</small></tt>
vi: <tt><small>Tuần trăng: %s</small></tt>

source: <tt><small>Moon phase: Unknown</small></tt>
kk: <tt><small>Ай фазасы: Белгісіз</small></tt>
vi: <tt><small>Tuần trăng: Không xác định</small></tt>

source: <tt><small>Moonrise: The moon never rises this day.</small></tt>
kk: <tt><small>Айдың шығуы: Бұл күні ай шықпайды.</small></tt>
vi: <tt><small>Trăng mọc: Ngày này mặt trăng không bao giờ mọc.</small></tt>

source: <tt><small>Moonset: The moon never sets this day.</small></tt>
kk: <tt><small>Айдың батуы: Бұл күні ай батпайды.</small></tt>
vi: <tt><small>Trăng lặn: Hôm nay mặt trăng không bao giờ lặn.</small></tt>

source: <tt><small>Moonrise: %s</small></tt>
kk: <tt><small>Айдың шығуы: %s</small></tt>
vi: <tt><small>Trăng mọc: %s</small></tt>

source: <tt><small>Moonset: %s</small></tt>
kk: <tt><small>Айдың батуы: %s</small></tt>
vi: <tt><small>Trăng lặn: %s</small></tt>

source: Morning
kk: Таңертең
vi: Buổi sáng

source: Afternoon
kk: Күндіз
vi: Buổi chiều

source: Evening
kk: Кешкісін
vi: Buổi tối

source: Night
kk: Түнде
vi: Đêm

source: Weather Report
kk: Ауа райы есебі
vi: Báo cáo thời tiết

source: No location selected.
kk: Орналасу таңдалмады.
vi: Không có vị trí nào được chọn.

source: Please set a location in the plugin settings.
kk: Орналасуыңызды плагин баптауларында көрсетіңіз.
vi: Vui lòng đặt vị trí trong cài đặt plugin.

source: Currently no data available.
kk: Қазіргі уақытта мәліметтер жоқ.
vi: Hiện nay không có dữ liệu có sẵn.

source: Plugin settings...
kk: Плагин баптаулары...
vi: Cài đặt plugin...

source: _Forecast
kk: _Болжам
vi: _Dự báo

source: _Details
kk: _Мәліметтер
vi: _Chi tiết

source: New moon
kk: Жаңа ай
vi: Trăng non

source: Waxing crescent
kk: Өсіп келе жатқан жарты ай
vi: Tẩy lông hình lưỡi liềm

source: First quarter
kk: Бірінші тоқсан
vi: Quý đầu tiên

source: Waxing gibbous
kk: Өсіп келе жатқан ай
vi: Tẩy lông vượn

source: Full moon
kk: Толған ай
vi: Trăng tròn

source: Waning gibbous
kk: Кішірейіп келе жатқан ай
vi: Vượn yếu dần

source: Third quarter
kk: Үшінші тоқсан
vi: Quý 3

source: Waning crescent
kk: Кішірейіп келе жатқан жарты ай
vi: Lưỡi liềm suy yếu

source: Sunny
kk: Күн шуақты
vi: Nhiều nắng

source: Clear
kk: Ашық
vi: Thông thoáng

source: Lightly cloudy
kk: Аздаған бұлтты
vi: Có mây nhẹ

source: Partly cloudy
kk: Жартылай бұлтты
vi: Có mây rải rác

source: Cloudy
kk: Бұлтты
vi: Nhiều mây

source: Rain showers
kk: Өткінші жаңбыр
vi: Mưa rào

source: Thunder showers
kk: Күн күркіреген өткінші жаңбыр
vi: Mưa sấm sét

source: Sleet showers
kk: Өткінші жылбысқы қар
vi: Mưa đá

source: Snow showers
kk: Өткінші қар
vi: Mưa tuyết

source: Light rain
kk: Аздаған жаңбыр
vi: Mưa nhẹ

source: Rain
kk: Жаңбыр
vi: Cơn mưa

source: Rain with thunder
kk: Күн күркіреп жауған жаңбыр
vi: Mưa có sấm sét

source: Sleet
kk: Жылбысқы қар
vi: Mưa tuyết

source: Snow
kk: Қар
vi: Tuyết

source: Thundersnow
kk: Күн күркіреп жауған қар
vi: Sấm tuyết

source: Sleet showers with thunder
kk: Күн күркіреген өткінші жылбысқы қар
vi: Mưa rào kèm theo sấm sét

source: Snow showers with thunder
kk: Күн күркіреген өткінші қар
vi: Mưa tuyết kèm theo sấm sét

source: Light rain with thunder
kk: Күн күркіреп жауған аздаған жаңбыр
vi: Mưa nhẹ có sấm sét

source: Sleet with thunder
kk: Күн күркіреп жауған жылбысқы қар
vi: Mưa đá có sấm sét

source: GeoNames
vi: Tên địa lý
