Repository: xfce-mirror/xfce4-weather-plugin
Catalog: po/*.po
Languages: kk, vi

source: The current Fahrenheit temperature scale is based on one proposed in 1724 by the physicist Daniel Gabriel Fahrenheit. 0 °F was the freezing point of brine on the original scale at standard atmospheric pressure, which was the lowest temperature achievable with this mixture of ice, salt and ammonium chloride. The melting point of water is at 32 °F and its boiling point at 212 °F. The Fahrenheit and Celsius scales intersect at -40 degrees. Even in cold winters, the temperatures usually do not fall into negative ranges on the Fahrenheit scale. With its inventor being a member of the Royal Society in London and having a high reputation, the Fahrenheit scale enjoyed great popularity in many English-speaking countries, but was replaced by the Celsius scale in most of these countries during the metrification process in the mid to late 20th century.
kk: Қазіргі Фаренгейт температура шкаласы 1724 жылы физик Даниэль Габриэль Фаренгейт ұсынған шкалаға негізделген. 0 °F стандартты атмосфералық қысымдағы тұзды ерітіндінің қату нүктесі болды, бұл мұз, тұз және аммоний хлориді қоспасымен қол жеткізуге болатын ең төменгі температура еді. Судың қату нүктесі 32 °F, ал қайнау нүктесі 212 °F құрайды. Фаренгейт және Цельсий шкалалары -40 градуста қиылысады. Тіпті суық қыста да Фаренгейт шкаласы бойынша температура әдетте теріс мәндерге түспейді. Оны ойлап тапқан адам Лондон корольдік қоғамының мүшесі болғандықтан және жоғары беделге ие болғандықтан, Фаренгейт шкаласы көптеген ағылшын тілді елдерде үлкен танымалдылыққа ие болды, бірақ 20-шы ғасырдың ортасы мен соңында метризациялау процесі кезінде бұл елдердің көпшілігінде Цельсий шкаласымен алмастырылды.
vi: Thang đo nhiệt độ Fahrenheit hiện tại dựa trên thang đo được đề xuất vào năm 1724 bởi nhà vật lý Daniel Gabriel Fahrenheit. 0 °F là điểm đóng băng của nước muối ở thang đo ban đầu ở áp suất khí quyển tiêu chuẩn, là nhiệt độ thấp nhất có thể đạt được với hỗn hợp nước đá, muối và amoni clorua này. Điểm nóng chảy của nước là 32°F và điểm sôi là 212°F. Thang đo độ F và độ C giao nhau ở -40 độ. Ngay cả trong mùa đông lạnh giá, nhiệt độ thường không rơi vào phạm vi âm theo thang đo Fahrenheit. Với việc nhà phát minh ra nó là thành viên của Hiệp hội Hoàng gia ở Luân Đôn và có danh tiếng cao, thang đo Fahrenheit rất phổ biến ở nhiều quốc gia nói tiếng Anh, nhưng đã bị thay thế bằng thang đo độ C ở hầu hết các quốc gia này trong quá trình đo lường vào giữa đến cuối thế kỷ 20.

source: The pascal, named after mathematician, physicist and philosopher Blaise Pascal, is a SI derived unit and a measure of force per unit area, defined as one newton per square meter. One standard atmosphere (atm) is 1013.25 hPa.
kk: Математик, физик және философ Блез Паскальдың құрметіне аталған паскаль — ХБЖ туынды бірлігі және бір шаршы метрге бір ньютон ретінде анықталатын аудан бірлігіне түсетін күш өлшемі. Бір стандартты атмосфера (атм) 1013,25 гПа құрайды.
vi: Pascal, được đặt theo tên của nhà toán học, vật lý học và triết học Blaise Pascal, là đơn vị dẫn xuất SI và là thước đo lực trên một đơn vị diện tích, được định nghĩa là một newton trên một mét vuông. Một bầu không khí tiêu chuẩn (atm) là 1013,25 hPa.

source: Inches of mercury is still widely used for barometric pressure in weather reports, refrigeration and aviation in the United States, but seldom used elsewhere. It is defined as the pressure exerted by a 1 inch circular column of mercury of 1 inch in height at 32 °F (0 °C) at the standard acceleration of gravity.
kk: Сынап бағанасының дюймі АҚШ-тағы ауа райы есептерінде, салқындату жүйелерінде және авиацияда барометрлік қысым үшін әлі де кеңінен қолданылады, бірақ басқа жерлерде сирек пайдаланылады. Ол 32 °F (0 °C) температурада стандартты еркін түсу үдеуі кезінде биіктігі 1 дюйм болатын сынаптың дөңгелек бағанасы түсіретін қысым ретінде анықталады.
vi: Inch thủy ngân vẫn được sử dụng rộng rãi làm áp suất khí quyển trong báo cáo thời tiết, điện lạnh và hàng không ở Hoa Kỳ, nhưng hiếm khi được sử dụng ở những nơi khác. Nó được định nghĩa là áp suất gây ra bởi cột thủy ngân tròn 1 inch có chiều cao 1 inch ở 32 ° F (0 ° C) với gia tốc trọng trường tiêu chuẩn.

source: The pound per square inch is a unit of pressure based on avoirdupois units (a system of weights based on a pound of 16 ounces) and defined as the pressure resulting from a force of one pound-force applied to an area of one square inch. It is used in the United States and to varying degrees in everyday life in Canada, the United Kingdom and maybe some former British Colonies.
kk: Шаршы дюймге фунт — авуардюпуа бірліктеріне (16 унциялық фунтқа негізделген салмақ жүйесі) негізделген қысым бірлігі және бір шаршы дюйм ауданға түсетін бір фунт-күштен туындайтын қысым ретінде анықталады. Ол АҚШ-та және Канадада, Біріккен Корольдікте және кейбір бұрынғы Британдық колонияларда күнделікті өмірде әртүрлі дәрежеде қолданылады.
vi: Pao trên inch vuông là đơn vị áp suất dựa trên đơn vị avoirdupois (một hệ trọng lượng dựa trên pound 16 ounce) và được định nghĩa là áp suất do lực một pound tác dụng lên diện tích một inch vuông. Nó được sử dụng ở Hoa Kỳ và ở các mức độ khác nhau trong cuộc sống hàng ngày ở Canada, Vương quốc Anh và có thể một số thuộc địa cũ của Anh.

source: The torr unit was named after the physicist and mathematician Evangelista Torricelli who discovered the principle of the barometer in 1644 and demonstrated the first mercury barometer to the general public. A pressure of 1 torr is approximately equal to one millimeter of mercury, and one standard atmosphere (atm) equals 760 Torr.
kk: Торр бірлігі 1644 жылы барометр принципін ашқан және көпшілікке алғашқы сынап барометрін көрсеткен физик әрі математик Эванджелиста Торричеллидің құрметіне аталған. 1 торр қысымы шамамен бір миллиметр сынап бағанасына тең, ал бір стандартты атмосфера (атм) 760 торрға тең.
vi: Đơn vị torr được đặt theo tên của nhà vật lý và toán học Evangelista Torricelli, người đã phát hiện ra nguyên lý của phong vũ biểu vào năm 1644 và trình diễn phong vũ biểu thủy ngân đầu tiên cho công chúng. Áp suất 1 torr xấp xỉ bằng một milimet thủy ngân và một bầu khí quyển tiêu chuẩn (atm) bằng 760 Torr.

source: Wind speeds in TV or in the news are often provided in km/h.
kk: Теледидардағы немесе жаңалықтардағы жел жылдамдығы жиі км/сағ бірлігімен беріледі.
vi: Tốc độ gió trên TV hoặc trong tin tức thường được cung cấp bằng km/h.

source: Miles per hour is an imperial unit of speed expressing the number of statute miles covered in one hour.
kk: Миль/сағ — бір сағатта жүріп өткен жарғылық мильдер санын білдіретін жылдамдықтың империялық бірлігі.
vi: Dặm trên giờ là đơn vị đo tốc độ của hệ Anh thể hiện số dặm quy chế được bao phủ trong một giờ.

source: Meter per second is <i>the</i> unit typically used by meteorologists to denote wind speeds.
kk: Метр/секунд — бұл метеорологтар жел жылдамдығын белгілеу үшін әдетте қолданатын бірлік.
vi: Mét trên giây là <i>đơn vị</i> thường được các nhà khí tượng học sử dụng để biểu thị tốc độ gió.

source: The foot per second (pl. feet per second) in the imperial unit system is the counterpart to the meter per second in the International System of Units.
kk: Империялық бірліктер жүйесіндегі фут/секунд — бұл Халықаралық бірліктер жүйесіндегі метр/секундтың баламасы.
vi: Foot trên giây (pl. feet trên giây) trong hệ đơn vị đo lường Anh là đối trọng của mét trên giây trong Hệ đơn vị quốc tế.

source: The knot is a unit of speed equal to one international nautical mile (1.852 km) per hour, or approximately 1.151 mph, and sees worldwide use in meteorology and in maritime and air navigation. A vessel travelling at 1 knot along a meridian travels one minute of geographic latitude in one hour.
kk: Түйін — бір халықаралық теңіз миліне (1,852 км/сағ) немесе шамамен 1,151 миль/сағ-қа тең жылдамдық бірлігі, ол бүкіл дүние жүзінде метеорологияда, теңіз және әуе навигациясында қолданылады. Меридиан бойымен 1 түйін жылдамдықпен қозғалатын кеме бір сағатта географиялық ендіктің бір минутын жүріп өтеді.
vi: Nút thắt là một đơn vị tốc độ tương đương với một hải lý quốc tế (1,852 km) mỗi giờ, hoặc khoảng 1,151 mph, và được sử dụng trên toàn thế giới trong khí tượng học, hàng hải và hàng không. Một con tàu di chuyển với tốc độ 1 hải lý dọc theo kinh tuyến sẽ đi một phút vĩ độ địa lý trong một giờ.

source: 1 millimeter is one thousandth of a meter - the fundamental unit of length in the International System of Units -, or approximately 0.04 inches.
kk: 1 миллиметр — Халықаралық бірліктер жүйесіндегі ұзындықтың негізгі бірлігі болып табылатын метрдің мыңнан бір бөлігі немесе шамамен 0,04 дюйм.
vi: 1 milimét là một phần nghìn mét - đơn vị đo chiều dài cơ bản trong Hệ đơn vị quốc tế - hoặc xấp xỉ 0,04 inch.

source: The English word <i>inch</i> comes from Latin <i>uncia</i> meaning <i>one-twelfth part</i> (in this case, one twelfth of a foot). In the past, there have been many different standards of the inch with varying sizes of measure, but the current internationally accepted value is exactly 25.4 millimeters.
kk: Ағылшын тіліндегі <i>inch</i> (дюйм) сөзі латынның <i>uncia</i> сөзінен шыққан, ол <i>он екінші бөлік</i> дегенді білдіреді (бұл жағдайда футтың он екінші бөлігі). Бұрын дюймнің әртүрлі өлшемдері бар көптеген стандарттары болған, бірақ қазіргі уақытта халықаралық деңгейде қабылданған мән дәл 25,4 миллиметрді құрайды.
vi: Từ tiếng Anh <i>inch</i> xuất phát từ tiếng Latin <i>uncia</i> có nghĩa là <i>một phần mười hai</i> (trong trường hợp này là một phần mười hai foot). Trước đây, đã có nhiều tiêu chuẩn inch khác nhau với các kích thước đo khác nhau nhưng giá trị được quốc tế chấp nhận hiện nay chính xác là 25,4 mm.

source: The meter is the fundamental unit of length in the International System of Units. Originally intended to be one ten-millionth of the distance from the Earth's equator to the North Pole at sea level, its definition has been periodically refined to reflect growing knowledge of metrology (the science of measurement).
kk: Метр — Халықаралық бірліктер жүйесіндегі ұзындықтың негізгі бірлігі. Алғашқыда Жер экваторынан теңіз деңгейіндегі Солтүстік полюске дейінгі қашықтықтың он миллионнан бірі ретінде жоспарланған, оның анықтамасы метрология (өлшеу туралы ғылым) саласындағы білімнің артуына байланысты мезгіл-мезгіл жетілдіріліп отырды.
vi: Mét là đơn vị đo chiều dài cơ bản trong Hệ đơn vị quốc tế. Ban đầu được dự định là một phần mười triệu khoảng cách từ xích đạo Trái đất đến Bắc Cực ở mực nước biển, định nghĩa của nó đã được cải tiến định kỳ để phản ánh kiến ​​thức ngày càng tăng về đo lường học (khoa học đo lường).

source: A foot (plural feet) is a unit of length defined as being 0.3048 m exactly and used in the imperial system of units and United States customary units. It is subdivided into 12 inches. The measurement of altitude in the aviation industry is one of the few areas where the foot is widely used outside the English-speaking world.
kk: Фут — дәл 0,3048 м деп анықталған ұзындық бірлігі, империялық бірліктер жүйесінде және АҚШ-тың дәстүрлі бірліктер жүйесінде қолданылады. Ол 12 дюймге бөлінеді. Авиация саласындағы биіктікті өлшеу — фут ағылшын тілді елдерден тыс жерлерде кеңінен қолданылатын санаулы салалардың бірі.
vi: Một foot (số nhiều feet) là một đơn vị chiều dài được xác định chính xác là 0,3048 m và được sử dụng trong hệ đơn vị đo lường Anh và các đơn vị thông thường của Hoa Kỳ. Nó được chia thành 12 inch. Việc đo độ cao trong ngành hàng không là một trong số ít lĩnh vực mà bàn chân được sử dụng rộng rãi bên ngoài thế giới nói tiếng Anh.

source: Used in North America, wind chill will be reported for low temperatures and heat index for higher ones. At night, heat index will be replaced by the Summer Simmer Index. For wind chill, wind speeds need to be above 3.0 mph (4.828 km/h) and air temperature below 50.0 °F (10.0 °C). For heat index, air temperature needs to be above 80 °F (26.7 °C) - or above 71.6 °F (22 °C) at night - and relative humidity at least 40%. If these conditions are not met, the air temperature will be shown.
kk: Солтүстік Америкада қолданылатын желдің салқындату коэффициенті (wind chill) төмен температуралар үшін, ал жылу индексі (heat index) жоғары температуралар үшін көрсетіледі. Түнде жылу индексі Summer Simmer индексімен алмастырылады. Желдің салқындатуы үшін жел жылдамдығы 3,0 миль/сағ (4,828 км/сағ) жоғары, ал ауа температурасы 50,0 °F (10,0 °C) төмен болуы керек. Жылу индексі үшін ауа температурасы 80 °F (26,7 °C) — немесе түнде 71,6 °F (22 °C) — жоғары және салыстырмалы ылғалдылық кемінде 40% болуы керек. Егер бұл шарттар орындалмаса, ауа температурасы көрсетіледі.
vi: Được sử dụng ở Bắc Mỹ, gió lạnh sẽ được báo cáo ở nhiệt độ thấp và chỉ số nhiệt ở nhiệt độ cao hơn. Vào ban đêm, chỉ số nhiệt sẽ được thay thế bằng chỉ số Simmer Summer. Đối với gió lạnh, tốc độ gió cần phải trên 3,0 mph (4,828 km/h) và nhiệt độ không khí dưới 50,0 ° F (10,0 ° C). Đối với chỉ số nhiệt, nhiệt độ không khí cần phải trên 80 °F (26,7 °C) - hoặc trên 71,6 °F (22 °C) vào ban đêm - và độ ẩm tương đối ít nhất 40%. Nếu những điều kiện này không được đáp ứng, nhiệt độ không khí sẽ được hiển thị.

source: The Canadian counterpart to the US windchill/heat index, with the wind chill being similar to the previous model but with slightly different constraints. Instead of the heat index <i>humidex</i> will be used. For wind chill to become effective, wind speeds need to be above 2.0 km/h (1.24 mph) and air temperature below or equal to 0 °C (32 °F). For humidex, air temperature needs to be at least 20.0 °C (68 °F), with a dewpoint greater than 0 °C (32 °F). If these conditions are not met, the air temperature will be shown.
kk: АҚШ-тың желдің салқындату/жылу индексінің канадалық баламасы, мұндағы желдің салқындатуы алдыңғы модельге ұқсас, бірақ шектеулері сәл өзгеше. Жылу индексінің орнына <i>humidex</i> қолданылады. Желдің салқындатуы күшіне енуі үшін жел жылдамдығы 2,0 км/сағ (1,24 миль/сағ) жоғары және ауа температурасы 0 °C (32 °F) тең немесе одан төмен болуы керек. Humidex үшін ауа температурасы кемінде 20,0 °C (68 °F), ал шық нүктесі 0 °C (32 °F) жоғары болуы керек. Егер бұл шарттар орындалмаса, ауа температурасы көрсетіледі.
vi: Đối tác của Canada với chỉ số gió/nhiệt gió của Hoa Kỳ, với gió lạnh tương tự như mô hình trước đó nhưng có những hạn chế hơi khác. Thay vì chỉ số nhiệt <i>humidex</i> sẽ được sử dụng. Để gió làm lạnh có hiệu quả, tốc độ gió cần phải trên 2,0 km/h (1,24 mph) và nhiệt độ không khí dưới hoặc bằng 0 °C (32 °F). Đối với Humidex, nhiệt độ không khí cần ít nhất là 20,0 °C (68 °F), với điểm sương lớn hơn 0 °C (32 °F). Nếu những điều kiện này không được đáp ứng, nhiệt độ không khí sẽ được hiển thị.

source: This is the model used by the Australian Bureau of Meteorology, especially adapted for the climate of this continent. Possibly used in Central Europe and parts of other continents too, but then windchill and similar values had never gained that much popularity there as in the US or Canada, so information about its usage is scarce or uncertain. It depends on air temperature, wind speed and humidity and can be used for lower and higher temperatures alike.
kk: Бұл Австралия метеорология бюросы қолданатын, осы континенттің климатына арнайы бейімделген модель. Ол Орталық Еуропада және басқа континенттердің кейбір бөліктерінде де қолданылуы мүмкін, бірақ ол жерлерде желдің салқындатуы мен ұқсас мәндер АҚШ немесе Канададағыдай танымал болмағандықтан, оны қолдану туралы ақпарат тапшы немесе белгісіз. Ол ауа температурасына, жел жылдамдығына және ылғалдылыққа байланысты және төмен, сондай-ақ жоғары температуралар үшін де қолданыла береді.
vi: Đây là mô hình được Cục Khí tượng Australia sử dụng, đặc biệt phù hợp với khí hậu của lục địa này. Có thể được sử dụng ở Trung Âu và các khu vực của các lục địa khác, nhưng khi đó gió và các giá trị tương tự chưa bao giờ trở nên phổ biến ở đó như ở Mỹ hoặc Canada, vì vậy thông tin về cách sử dụng nó rất khan hiếm hoặc không chắc chắn. Nó phụ thuộc vào nhiệt độ không khí, tốc độ gió và độ ẩm và có thể được sử dụng cho cả nhiệt độ thấp hơn và cao hơn.

source: Improvements by Robert G. Quayle and Robert G. Steadman applied in 1998 to earlier experiments/developments by Steadman. This model only depends on wind speed and temperature, not on relative humidity and can be used for both heat and cold stress.
kk: 1998 жылы Роберт Г. Куэйл мен Роберт Г. Стидманның Стидманның алдыңғы тәжірибелеріне/әзірлемелеріне енгізген жақсартулары. Бұл модель тек жел жылдамдығы мен температураға байланысты, салыстырмалы ылғалдылыққа тәуелді емес және ыстық, сондай-ақ суық стрессті анықтау үшін де қолданыла алады.
vi: Những cải tiến của Robert G. Quayle và Robert G. Steadman được áp dụng vào năm 1998 cho các thử nghiệm/phát triển trước đó của Steadman. Mô hình này chỉ phụ thuộc vào tốc độ gió và nhiệt độ, không phụ thuộc vào độ ẩm tương đối và có thể được sử dụng cho cả ứng suất nhiệt và ứng suất lạnh.

source: Choose an icon theme.
kk: Таңбашалар тақырыбын таңдаңыз.
vi: Chọn một chủ đề biểu tượng.

source: <b>Directory:</b> %s <b>Author:</b> %s <b>Description:</b> %s <b>License:</b> %s
kk: <b>Бума:</b> %s <b>Авторы:</b> %s <b>Сипаттамасы:</b> %s <b>Лицензиясы:</b> %s
vi: <b>Thư mục:</b> %s <b>Tác giả:</b> %s <b>Mô tả:</b> %s <b>Giấy phép:</b> %s

source: A more calendar-like view, with the days in columns and the daytimes (morning, afternoon, evening, night) in rows.
kk: Күндер бағандарда, ал тәулік уақыттары (таңертең, түс, кеш, түн) жолдарда орналасқан күнтізбеге ұқсас көрініс.
vi: Chế độ xem giống lịch hơn, với các ngày theo cột và ban ngày (sáng, chiều, tối, đêm) theo hàng.

source: Shows the forecasts in a table with the daytimes (morning, afternoon, evening, night) in columns and the days in rows.
kk: Болжамдарды тәулік уақыттары (таңертең, түс, кеш, түн) бағандарда, ал күндер жолдарда орналасқан кестеде көрсетеді.
vi: Hiển thị dự báo dưới dạng bảng với các ngày (sáng, chiều, tối, đêm) theo cột và ngày theo hàng.

source: Met.no provides forecast data for up to %d days in the future. Choose how many days will be shown in the forecast tab in the summary window. On slower computers, a lower number might help against lags when opening the window. Note however that usually forecasts for more than three days in the future are unreliable at best ;-)
kk: Met.no болашақ %d күнге дейінгі болжам деректерін ұсынады. Жиынтық терезесіндегі болжам бетінде неше күн көрсетілетінін таңдаңыз. Баяу компьютерлерде аз санды таңдау терезені ашқандағы кідірістерді азайтуға көмектесуі мүмкін. Бірақ ескеретін жайт, әдетте үш күннен асатын болжамдар аса сенімді емес ;-)
vi: Met.no cung cấp dữ liệu dự báo cho tối đa %d ngày trong tương lai. Chọn số ngày sẽ được hiển thị trong tab dự báo trong cửa sổ tóm tắt. Trên các máy tính chậm hơn, con số thấp hơn có thể giúp chống lại độ trễ khi mở cửa sổ. Tuy nhiên, xin lưu ý rằng thông thường dự báo trong hơn ba ngày trong tương lai là không đáng tin cậy nhất ;-)

source: Select font
kk: Қаріпті таңдаңыз
vi: Chọn phông chữ

source: Choose the value to add to the list below. Values can be added more than once.
kk: Төмендегі тізімге қосу үшін мәнді таңдаңыз. Мәндерді бірнеше рет қосуға болады.
vi: Chọn giá trị để thêm vào danh sách bên dưới. Các giá trị có thể được thêm nhiều lần.

source: Air temperature, sometimes referred to as dry-bulb temperature. Measured by a thermometer that is freely exposed to the air, yet shielded from radiation and moisture.
kk: Ауа температурасы, кейде құрғақ термометр температурасы деп те аталады. Ол ауада еркін орналасқан, бірақ радиация мен ылғалдан қорғалған термометрмен өлшенеді.
vi: Nhiệt độ không khí, đôi khi được gọi là nhiệt độ bầu khô. Được đo bằng nhiệt kế tiếp xúc tự do với không khí nhưng được bảo vệ khỏi bức xạ và độ ẩm.

source: The weight of the air that makes up the atmosphere exerts a pressure on the surface of the Earth, which is known as atmospheric pressure. To make it easier to compare the value to other values for locations with different altitudes, atmospheric pressure is adjusted to the equivalent sea-level pressure and called barometric pressure. Rising barometric pressures generally indicate an improvement in weather conditions, while falling pressures mean deterioration.
kk: Атмосфераны құрайтын ауаның салмағы Жер бетіне қысым түсіреді, бұл атмосфералық қысым деп аталады. Мәнді әртүрлі биіктіктегі орындардың басқа мәндерімен салыстыруды жеңілдету үшін атмосфералық қысым теңіз деңгейіндегі баламалы қысымға сәйкестендіріледі және барометрлік қысым деп аталады. Барометрлік қысымның көтерілуі әдетте ауа райы жағдайының жақсаруын білдіреді, ал қысымның төмендеуі оның нашарлауын білдіреді.
vi: Trọng lượng của không khí tạo nên bầu khí quyển tạo ra một áp suất lên bề mặt Trái đất, được gọi là áp suất khí quyển. Để dễ dàng so sánh giá trị với các giá trị khác ở các vị trí có độ cao khác nhau, áp suất khí quyển được điều chỉnh theo áp suất mực nước biển tương đương và gọi là áp suất khí quyển. Áp suất khí quyển tăng thường cho thấy sự cải thiện về điều kiện thời tiết, trong khi áp suất giảm có nghĩa là tình trạng xấu đi.

source: Nowadays wind speed/velocity is measured using an anemometer (Greek <i>anemos</i>, meaning <i>wind</i>) in 10 m (33 ft) height. Anemometers usually measure either wind speed or pressure, but will provide both values as they are closely related to and can be deduced from each other.
kk: Қазіргі уақытта желдің жылдамдығы/қарқыны 10 м (33 фут) биіктікте анемометрмен (гректің <i>anemos</i> — <i>жел</i> сөзінен) өлшенеді. Анемометрлер әдетте жел жылдамдығын немесе қысымын өлшейді, бірақ бұл екі мән бір-бірімен тығыз байланысты және бірінен бірін есептеп шығаруға болатындықтан, екеуі де беріледі.
vi: Ngày nay tốc độ/vận tốc gió được đo bằng máy đo gió (tiếng Hy Lạp <i>anemos</i>, nghĩa là <i>gió</i>) ở độ cao 10 m (33 ft). Máy đo gió thường đo tốc độ gió hoặc áp suất, nhưng sẽ cung cấp cả hai giá trị vì chúng có liên quan chặt chẽ và có thể suy ra từ nhau.

source: Invented by Sir Francis Beaufort in 1805, this empirical scale on wind speed is based on people's observations of specific land or sea conditions, denoting these conditions with numbers from 0 (calm) to 12 (hurricane).
kk: 1805 жылы сэр Фрэнсис Бофорт ойлап тапқан бұл жел жылдамдығының эмпирикалық шкаласы адамдардың нақты құрлық немесе теңіз жағдайларын бақылауына негізделген және бұл жағдайларды 0-ден (тымық) 12-ге (дауыл) дейінгі сандармен белгілейді.
vi: Được phát minh bởi Sir Francis Beaufort vào năm 1805, thang đo thực nghiệm về tốc độ gió này dựa trên quan sát của người dân về các điều kiện cụ thể trên đất liền hoặc biển, biểu thị các điều kiện này bằng các số từ 0 (bình tĩnh) đến 12 (bão).

source: This gives the cardinal direction (North, East, South, West) the wind is coming from.
kk: Бұл желдің қай тараптан (Солтүстік, Шығыс, Оңтүстік, Батыс) соғып тұрғанын көрсетеді.
vi: Điều này cho biết hướng chính (Bắc, Đông, Nam, Tây) của gió.

source: This gives the direction the wind is coming from in azimuth degrees (North = 0°, East = 90°, South = 180° and West = 270°).
kk: Бұл желдің соғу бағытын азимуттық градуспен береді (Солтүстік = 0°, Шығыс = 90°, Оңтүстік = 180° және Батыс = 270°).
vi: Điều này cho biết hướng gió đến theo góc phương vị (Bắc = 0°, Đông = 90°, Nam = 180° và Tây = 270°).
