Repository: xfce-mirror/xfce4-weather-plugin
Catalog: po/*.po
Languages: kk, vi

source: Weather Update
kk: Ауа райын жаңарту
vi: Cập nhật thời tiết

source: Show current weather conditions
kk: Ағымдағы ауа райы жағдайын көрсету
vi: Hiển thị điều kiện thời tiết hiện tại

source: _Help
kk: Кө_мек
vi: Trợ _giúp

source: _Close
kk: _Жабу
vi: Đó_ng

source: Location _name:
kk: Орналасу а_тауы:
vi: _Tên vị trí:

source: Latitud_e:
kk: Енді_к:
vi: _Vĩ độ:

source: L_ongitude:
kk: Бо_йлық:
vi: _Kinh độ:

source: Altitu_de:
kk: Биікті_к:
vi: Độ _cao:

source: _Timezone:
kk: _Уақыт белдеуі:
vi: _Múi giờ:

source: Latitude specifies the north-south position of a point on the Earth's surface. If you change this value manually, you need to provide altitude and timezone manually too.
kk: Ендік Жер бетіндегі нүктенің солтүстік-оңтүстік бағытындағы орнын анықтайды. Егер бұл мәнді қолмен өзгертсеңіз, биіктік пен уақыт белдеуін де қолмен көрсетуіңіз керек.
vi: Vĩ độ xác định vị trí bắc-nam của một điểm trên bề mặt Trái đất. Nếu bạn thay đổi giá trị này theo cách thủ công, bạn cũng cần cung cấp độ cao và múi giờ theo cách thủ công.

source: Longitude specifies the east-west position of a point on the Earth's surface. If you change this value manually, you need to provide altitude and timezone manually too.
kk: Бойлық Жер бетіндегі нүктенің шығыс-батыс бағытындағы орнын анықтайды. Егер бұл мәнді қолмен өзгертсеңіз, биіктік пен уақыт белдеуін де қолмен көрсетуіңіз керек.
vi: Kinh độ xác định vị trí đông tây của một điểm trên bề mặt Trái đất. Nếu bạn thay đổi giá trị này theo cách thủ công, bạn cũng cần cung cấp độ cao và múi giờ theo cách thủ công.

source: For locations outside Norway the elevation model that's used by the met.no webservice is not very good, so it's usually necessary to specify the altitude as an additional parameter, otherwise the reported values will not be correct. The plugin tries to auto-detect the altitude using the GeoNames webservice, but that might not always be correct too, so you can change it here. Altitude is given in meters above sea level, or alternatively in feet by changing the unit on the units page. It should match the real value roughly, but small differences will have no influence on the weather data. Inside Norway, this setting has no effect at all.
kk: Норвегиядан тыс жерлер үшін met.no веб-сервисі қолданатын биіктік моделі онша жақсы емес, сондықтан биіктікті қосымша параметр ретінде көрсету қажет, әйтпесе көрсетілген мәндер дұрыс болмайды. Плагин биіктікті GeoNames веб-сервисі арқылы автоматты түрде анықтауға тырысады, бірақ ол да әрдайым дұрыс бола бермейді, сондықтан оны осы жерде өзгерте аласыз. Биіктік теңіз деңгейінен жоғары метрмен немесе өлшем бірліктері бетінде бірлікті өзгерту арқылы футпен беріледі. Ол нақты мәнге шамамен сәйкес келуі керек, бірақ кішігірім айырмашылықтар ауа райы деректеріне әсер етпейді. Норвегия ішінде бұл параметрдің ешқандай әсері жоқ.
vi: Đối với các vị trí bên ngoài Na Uy, mô hình độ cao được dịch vụ web met.no sử dụng không tốt lắm, do đó, thường cần phải chỉ định độ cao làm tham số bổ sung, nếu không các giá trị được báo cáo sẽ không chính xác. Plugin cố gắng tự động phát hiện độ cao bằng dịch vụ web GeoNames nhưng điều đó không phải lúc nào cũng chính xác, vì vậy bạn có thể thay đổi nó tại đây. Độ cao được tính bằng mét so với mực nước biển hoặc cách khác là tính bằng feet bằng cách thay đổi đơn vị trên trang đơn vị. Nó phải khớp với giá trị thực một cách đại khái, nhưng những khác biệt nhỏ sẽ không ảnh hưởng đến dữ liệu thời tiết. Bên trong Na Uy, cài đặt này không có tác dụng gì cả.

source: feet
kk: фут
vi: bàn chân

source: If the chosen location is not in your current timezone, then it is necessary to <i>put</i> the plugin into that other timezone for the times to be shown correctly. The proper timezone will be auto-detected via the GeoNames web service, but you might want to correct it if necessary. Leave this field empty to use the timezone set by your system. Invalid entries will cause the use of UTC time, but that may also depend on your system.
kk: Егер таңдалған орналасу сіздің ағымдағы уақыт белдеуіңізде болмаса, уақыттың дұрыс көрсетілуі үшін плагинді сол басқа уақыт белдеуіне <i>қою</i> қажет. Тиісті уақыт белдеуі GeoNames веб-сервисі арқылы автоматты түрде анықталады, бірақ қажет болса оны түзетуіңізге болады. Жүйе орнатқан уақыт белдеуін пайдалану үшін бұл өрісті бос қалдырыңыз. Қате жазбалар UTC уақытының пайдаланылуына әкеледі, бірақ бұл жүйеңізге де байланысты болуы мүмкін.
vi: Nếu vị trí đã chọn không nằm trong múi giờ hiện tại của bạn thì cần <i>đặt</i> plugin vào múi giờ khác đó để thời gian được hiển thị chính xác. Múi giờ thích hợp sẽ được tự động phát hiện thông qua dịch vụ web GeoNames, nhưng bạn có thể muốn sửa nó nếu cần. Để trống trường này để sử dụng múi giờ do hệ thống của bạn đặt. Các mục nhập không hợp lệ sẽ gây ra việc sử dụng thời gian UTC, nhưng điều đó cũng có thể phụ thuộc vào hệ thống của bạn.

source: Change the name for the location to your liking. It is used for display and does not affect the location parameters in any way.
kk: Орналасудың атауын өз қалауыңызша өзгертіңіз. Ол тек көрсету үшін қолданылады және орналасу параметрлеріне ешқандай әсер етпейді.
vi: Thay đổi tên cho vị trí theo ý thích của bạn. Nó được sử dụng để hiển thị và không ảnh hưởng đến các thông số vị trí dưới bất kỳ hình thức nào.

source: Change...
kk: Өзгерту...
vi: Thay đổi...

source: Search for a new location and auto-detect its parameters.
kk: Жаңа орналасуды іздеу және оның параметрлерін автоматты түрде анықтау.
vi: Tìm kiếm vị trí mới và tự động phát hiện các thông số của nó.

source: Please change location name to your liking and correct altitude and timezone if they are not auto-detected correctly.
kk: Орналасу атауын өз қалауыңызша өзгертіңіз және биіктік пен уақыт белдеуі автоматты түрде дұрыс анықталмаса, оларды түзетіңіз.
vi: Vui lòng thay đổi tên vị trí theo ý thích của bạn và sửa độ cao cũng như múi giờ nếu chúng không được tự động phát hiện chính xác.

source: _Location
kk: _Орналасу
vi: _Vị trí

source: _Temperature:
kk: _Температура:
vi: _Nhiệt độ:

source: Barometric _pressure:
kk: _Барометрлік қысым:
vi: Áp suất khí quyển:

source: _Wind speed:
kk: _Жел жылдамдығы:
vi: _Tốc độ gió:

source: Prec_ipitations:
kk: Жауын-шашы_н:
vi: _Lượng mưa:

source: Apparent te_mperature:
kk: Сезілетін те_мпература:
vi: Nhiệt độ biểu kiến:

source: Celsius (°C)
kk: Цельсий (°C)
vi: Độ C (°C)

source: Fahrenheit (°F)
kk: Фаренгейт (°F)
vi: Độ F (°F)

source: Hectopascals (hPa)
kk: Гектопаскаль (гПа)
vi: Hectopascal (hPa)

source: Inches of mercury (inHg)
kk: Сынап бағанасының дюймі (дюйм сын. бағ)
vi: Inch thủy ngân (inHg)

source: Pound-force per square inch (psi)
kk: Квадрат дюймге фунт-күш (psi)
vi: Lực pound trên inch vuông (psi)

source: Torr (mmHg)
kk: Торр (мм сын. бағ.)

source: Kilometers per hour (km/h)
kk: Километр/сағат (км/сағ)
vi: Kilômét trên giờ (km/h)

source: Miles per hour (mph)
kk: Миля/сағат (миля/сағ)
vi: Dặm trên giờ (mph)

source: Meters per second (m/s)
kk: Метр/секунд (м/с)
vi: Mét trên giây (m/s)

source: Feet per second (ft/s)
kk: Фут/секунд (фт/с)
vi: Feet trên giây (ft/s)

source: Knots (kt)
kk: Узел (уз)
vi: Nút thắt (kt)

source: Millimeters (mm)
kk: Миллиметр (мм)
vi: Milimet (mm)

source: Inches (in)
kk: Дюйм (дм)
vi: Inch (trong)

source: Meters (m)
kk: Метр (м)
vi: Mét (m)

source: Feet (ft)
kk: Фут (фут)
vi: Bàn chân (ft)

source: Windchill/Heat index
kk: Желдің салқындатуы/Жылу индексі
vi: Chỉ số gió/nhiệt

source: Windchill/Humidex
kk: Желдің салқындатуы/Ылғалдылық индексі
vi: Gió lạnh / Humidex

source: Steadman
kk: Стидман

source: Quayle-Steadman
kk: Квейл-Стидман

source: _Units
kk: _Бірліктер
vi: Đơn _vị

source: Available icon themes are listed here. You can add icon themes to $HOME/.config/xfce4/weather/icons (or the equivalent directory on your system). Information about how to create or use icon themes can be found in the README file. New icon themes will be detected every time you open this config dialog.
kk: Қолжетімді таңбашалар темалары осында көрсетілген. Таңбашалар темаларын $HOME/.config/xfce4/weather/icons (немесе жүйеңіздегі баламалы бумаға) қосуға болады. Таңбашалар темаларын жасау немесе пайдалану туралы ақпаратты README файлынан табуға болады. Жаңа таңбашалар темалары осы баптау сұхбат терезесін ашқан сайын анықталады.
vi: Các chủ đề biểu tượng có sẵn được liệt kê ở đây. Bạn có thể thêm chủ đề biểu tượng vào $HOME/.config/xfce4/weather/icons (hoặc thư mục tương đương trên hệ thống của bạn). Thông tin về cách tạo hoặc sử dụng chủ đề biểu tượng có thể được tìm thấy trong tệp README. Chủ đề biểu tượng mới sẽ được phát hiện mỗi khi bạn mở hộp thoại cấu hình này.

source: _Icon theme:
kk: Таңбашалар _темасы:
vi: _Chủ đề biểu tượng:

source: Open the user icon themes directory in your file manager, creating it if necessary.
kk: Қажет болса, жасап, файл менеджерінде пайдаланушының таңбашалар темалары бумасын ашу.
vi: Mở thư mục chủ đề biểu tượng người dùng trong trình quản lý tệp của bạn, tạo nó nếu cần.

source: Use only a single _panel row
kk: Тек бір _панель қатарын пайдалану
vi: Chỉ sử dụng một hàng _panel duy nhất

source: Check to always use only a single row on a multi-row panel and a small icon in deskbar mode.
kk: Көп қатарлы панельде әрқашан тек бір қатарды және дескбар режимінде кішкентай таңбашаны пайдалану үшін белгілеңіз.
vi: Chọn để luôn chỉ sử dụng một hàng duy nhất trên bảng nhiều hàng và một biểu tượng nhỏ ở chế độ thanh bàn.

source: _Tooltip style:
kk: Тұспал _стилі:
vi: _Phong cách chú giải công cụ:

source: Choose your preferred tooltip style. Some styles give a lot of useful data, some are clearer but provide less data on a glance.
kk: Қалаған тұспал стилін таңдаңыз. Кейбір стильдер көптеген пайдалы деректерді береді, кейбіреулері түсініктірек, бірақ бір қарағанда аз дерек береді.
vi: Chọn kiểu chú giải công cụ ưa thích của bạn. Một số kiểu cung cấp nhiều dữ liệu hữu ích, một số kiểu rõ ràng hơn nhưng cung cấp ít dữ liệu hơn khi nhìn qua.

source: Simple
kk: Қарапайым
vi: Đơn giản

source: Verbose
kk: Толық
vi: Dài dòng

source: _Forecast layout:
kk: _Болжам жаймасы:
vi: _Bố trí dự báo:

source: Days in columns
kk: Күндер бағандарда
vi: Ngày trong cột

source: Days in rows
kk: Күндер жолдарда
vi: Ngày theo hàng

source: _Number of forecast days:
kk: Болжам күндерінің _саны:
vi: _Số ngày dự báo:

source: _Round values
kk: Мәндерді _дөңгелектеу
vi: _Giá trị tròn

source: _Appearance
kk: _Сыртқы түрі
vi: _Vẻ bề ngoài

source: Font and color:
kk: Қаріп пен түс:
vi: Phông chữ và màu sắc:

source: These are the values that will be shown in the scrollbox. Select a single value here and click the appropriate button to remove it or move it up and down in the list.
kk: Бұл айналдыру терезесінде көрсетілетін мәндер. Тізімнен бір мәнді таңдап, оны өшіру немесе тізімде жоғары-төмен жылжыту үшін тиісті батырманы басыңыз.
vi: Đây là những giá trị sẽ được hiển thị trong hộp cuộn. Chọn một giá trị ở đây và nhấp vào nút thích hợp để xóa nó hoặc di chuyển nó lên và xuống trong danh sách.

source: Move the selected value up in the list of labels to display.
kk: Таңдалған мәнді көрсетілетін белгілер тізімінде жоғары жылжыту.
vi: Di chuyển giá trị đã chọn lên trong danh sách nhãn cần hiển thị.

source: Move the selected value down in the list of labels to display.
kk: Таңдалған мәнді көрсетілетін белгілер тізімінде төмен жылжыту.
vi: Di chuyển giá trị đã chọn xuống trong danh sách nhãn cần hiển thị.

source: Temperature (T)
kk: Температура (Т)
vi: Nhiệt độ (T)

source: Barometric pressure (P)
kk: Барометрлік қысым (Қ)
vi: Áp suất khí quyển (P)

source: Wind speed (WS)
kk: Жел жылдамдығы (ЖЖ)
vi: Tốc độ gió (WS)

source: Wind speed - Beaufort scale (WB)
kk: Жел жылдамдығы - Бофорт шкаласы (ЖЖБ)
vi: Tốc độ gió - thang Beaufort (WB)

source: Wind direction (WD)
kk: Жел бағыты (ЖБ)
vi: Hướng gió (WD)

source: Wind direction in degrees (WD)
kk: Жел бағыты градуспен (ЖБ)
vi: Hướng gió tính bằng độ (WD)

source: Humidity (H)
kk: Ылғалдылық (Ы)
vi: Độ ẩm (H)

source: Dew point (D)
kk: Шық нүктесі (Ш)
vi: Điểm sương (D)

source: Apparent temperature (A)
kk: Сезілетін температура (СТ)
vi: Nhiệt độ biểu kiến ​​(A)

source: Low clouds (CL)
kk: Аздаған бұлттылық (БА)
vi: Mây thấp (CL)

source: Middle clouds (CM)
kk: Орташа бұлттылық (БО)
vi: Mây giữa (CM)

source: High clouds (CH)
kk: Жоғары бұлттылық (БЖ)
vi: Mây cao (CH)

source: Cloudiness (C)
kk: Бұлттылық (Б)
vi: Mây (C)

source: Fog (F)
kk: Тұман (М)
vi: Sương mù (F)

source: Precipitation (R)
kk: Жауын-шашын (У)
vi: Lượng mưa (R)

source: Add the selected value to the labels that should be displayed in the scrollbox.
kk: Таңдалған мәнді айналдыру терезесінде көрсетілетін белгілерге қосу.
vi: Thêm giá trị đã chọn vào nhãn sẽ được hiển thị trong hộp cuộn.

source: Select a value in the list of labels to display and click this button to remove it.
kk: Көрсетілетін белгілер тізімінен мәнді таңдап, оны өшіру үшін осы батырманы басыңыз.
vi: Chọn một giá trị trong danh sách nhãn cần hiển thị và nhấp vào nút này để xóa nó.

source: Li_nes:
kk: _Жолдар:
vi: _Dòng:

source: Decide how many values should be shown at once in the scrollbox. You can choose a smaller font or enlarge the panel to make more lines fit.
kk: Айналдыру терезесінде бір уақытта қанша мән көрсетілетінін шешіңіз. Көбірек жолдар сыюы үшін кішірек қаріпті таңдауға немесе панельді үлкейтуге болады.
vi: Quyết định số lượng giá trị sẽ được hiển thị cùng một lúc trong hộp cuộn. Bạn có thể chọn phông chữ nhỏ hơn hoặc zoom bảng điều khiển để phù hợp với nhiều dòng hơn.

source: Hide the scrollbox to save valuable space on the panel. Most interesting information is also provided in the tooltip - provided you choose an appropriate tooltip style - that is shown when hovering over the icon.
kk: Панельдегі бағалы орынды үнемдеу үшін айналдыру терезесін жасырыңыз. Ең қызықты ақпарат таңбашаның үстіне апарғанда көрсетілетін қалқымалы нұсқауда да (егер қалқымалы нұсқаудың тиісті стилін таңдасаңыз) беріледі.
vi: Ẩn hộp cuộn để tiết kiệm không gian quý giá trên bảng điều khiển. Thông tin thú vị nhất cũng được cung cấp trong chú giải công cụ - miễn là bạn chọn kiểu chú giải công cụ thích hợp - được hiển thị khi di chuột qua biểu tượng.

source: <b>Show scrollbox</b>
kk: <b>Айналдыру терезесін көрсету</b>
vi: <b>Hiển thị hộp cuộn</b>

source: Select _font
kk: Қаріпті _таңдау
vi: Chọn _phông chữ

source: Choose a font you like and set it to a smaller or larger size. Middle-click on the button to unset the font and use your theme's default.
kk: Өзіңізге ұнайтын қаріпті таңдап, оның өлшемін кішірек немесе үлкенірек етіп орнатыңыз. Қаріпті алып тастап, тақырыптың әдепкі қарпін пайдалану үшін батырманы ортаңғы батырмамен шертіңіз.
vi: Chọn một phông chữ bạn thích và đặt nó ở kích thước nhỏ hơn hoặc lớn hơn. Nhấp chuột giữa vào nút để bỏ đặt phông chữ và sử dụng phông chữ mặc định của chủ đề của bạn.

source: There may be problems with some themes that cause the scrollbox text to be hardly readable. If this is the case or you simply want it to appear in another color, then you can change it using this button. Middle-click on the button to unset the scrollbox text color.
kk: Кейбір темаларда айналдыру терезесіндегі мәтіннің оқылуы қиын болатын мәселелер болуы мүмкін. Егер солай болса немесе оның жай ғана басқа түсте болғанын қаласаңыз, оны осы батырма арқылы өзгерте аласыз. Айналдыру терезесі мәтінінің түсін алып тастау үшін батырманы ортаңғы батырмамен шертіңіз.
vi: Có thể có vấn đề với một số chủ đề khiến văn bản hộp cuộn khó đọc được. Nếu trường hợp này xảy ra hoặc bạn chỉ muốn nó xuất hiện bằng màu khác thì bạn có thể thay đổi nó bằng nút này. Nhấp chuột giữa vào nút để bỏ đặt màu văn bản hộp cuộn.

source: Animate transitions between labels
kk: Белгілер арасындағы ауысуларды анимациялау
vi: Tạo hiệu ứng chuyển tiếp giữa các nhãn

source: Scroll the current displayed value(s) out and the new value(s) in instead of simply changing them. Uncheck this option if you find the animation too distracting.
kk: Ағымдағы көрсетілген мәндерді жай ғана өзгертпей, оларды айналдырып шығарып, жаңа мәндерді айналдырып кіргізу. Егер анимация кедергі келтіреді деп тапсаңыз, бұл опцияны алып тастаңыз.
vi: Cuộn (các) giá trị được hiển thị hiện tại ra ngoài và (các) giá trị mới vào thay vì chỉ thay đổi chúng. Bỏ chọn tùy chọn này nếu bạn thấy hoạt ảnh quá gây mất tập trung.

source: _Scrollbox
kk: _Айналдыру терезесі
vi: _Hộp cuộn

source: T
kk: Т

source: P
kk: Қ

source: WS
kk: ЖЖ

source: WB
kk: ЖЖБ

source: WD
kk: ЖБ

source: H
kk: Ы

source: D
kk: Ш

source: A
kk: СТ

source: CL
kk: БА

source: CM
kk: БО

source: CH
kk: БЖ

source: C
kk: Б

source: F
kk: М

source: R
kk: У

source: No Data
kk: Деректер жоқ
vi: Không có dữ liệu

source: Short-term forecast data unavailable.
kk: Қысқа мерзімді болжам деректері қолжетімсіз.
vi: Dữ liệu dự báo ngắn hạn không có sẵn.

source: The sun never sets today.
kk: Бүгін күн батпайды.
vi: Hôm nay mặt trời không bao giờ lặn.

source: The sun never rises today.
kk: Бүгін күн шықпайды.
vi: Hôm nay mặt trời không bao giờ mọc.

source: The sun never rises and sets at %s.
kk: Күн шықпайды және %s уақытында батады.
vi: Mặt trời không bao giờ mọc và lặn vào lúc %s.

source: The sun rises at %s and never sets.
kk: Күн %s уақытында шығады және ешқашан батпайды.
vi: Mặt trời mọc lúc %s và không bao giờ lặn.

source: The sun rises at %s and sets at %s.
kk: Күн %s уақытында шығады және %s уақытында батады.
vi: Mặt trời mọc lúc %s và lặn lúc %s.

source: <b><span size="large">%s</span></b> <span size="medium">(%s)</span> <b><span size="large">%s</span></b> <b>Temperature:</b> %s <b>Wind:</b> %s from %s <b>Pressure:</b> %s <b>Humidity:</b> %s
kk: <b><span size="large">%s</span></b> <span size="medium">(%s)</span> <b><span size="large">%s</span></b> <b>Температура:</b> %s <b>Жел:</b> %s, %s бағытынан <b>Қысым:</b> %s <b>Ылғалдылық:</b> %s
vi: <b><span size="large">%s</span></b> <span size="medium">(%s)</span> <b><span size="large">%s</span></b> <b>Nhiệt độ:</b> %s <b>Gió:</b> %s từ %s <b>Áp lực:</b> %s <b>Độ ẩm:</b> %s

source: <b><span size="large">%s</span></b> <span size="medium">(%s)</span> <b><span size="large">%s</span></b> <span size="smaller">from %s to %s, with %s of precipitation</span> <b>Temperature:</b> %s <span size="smaller">(values at %s)</span> <b>Wind:</b> %s (%son the Beaufort scale) from %s(%s) <b>Pressure:</b> %s <b>Humidity:</b> %s <b>Fog:</b> %s <b>Cloudiness:</b> %s <span size="smaller">%s</span>
kk: <b><span size="large">%s</span></b> <span size="medium">(%s)</span> <b><span size="large">%s</span></b> <span size="smaller">%s бастап %s дейін, %s жауын-шашынмен</span> <b>Температура:</b> %s <span size="smaller">(%s кезіндегі мәндер)</span> <b>Жел:</b> %s (Бофорт шкаласы бойынша %s), %s(%s) бағытынан <b>Қысым:</b> %s <b>Ылғалдылық:</b> %s <b>Тұман:</b> %s <b>Бұлттылық:</b> %s <span size="smaller">%s</span>
vi: <b><span size="large">%s</span></b> <span size="medium">(%s)</span> <b><span size="large">%s</span></b> <span size="smaller">từ %s đến %s, với lượng mưa %s</span> <b>Nhiệt độ:</b> %s <span size="smaller">(giá trị tại %s)</span> <b>Gió:</b> %s (%stheo thang Beaufort) từ %s(%s) <b>Áp suất:</b> %s <b>Độ ẩm:</b> %s <b>Sương mù:</b> %s <b>Mây:</b> %s <span size="smaller">%s</span>

source: Cannot update weather data
kk: Ауа райы деректерін жаңарту мүмкін емес
vi: Không thể cập nhật dữ liệu thời tiết

source: Re_fresh
kk: Ж_аңарту
vi: Làm cho khỏe lại

source: Show weather conditions and forecasts
kk: Ауа райы жағдайын және болжамдарын көрсету
vi: Hiển thị điều kiện thời tiết và dự báo

source: Unset
kk: Орнатылмаған
vi: Bỏ đặt

source: Detecting...
kk: Анықтау...
vi: Đang phát hiện...

source: meters
kk: метр
vi: mét

source: Named after the astronomer Anders Celsius who invented the original scale in 1742, the Celsius scale is an international standard unit and nowadays defined using the Kelvin scale. 0 °C is equivalent to 273.15 K and 1 °C difference in temperature is exactly the same difference as 1 K. It is defined with the melting point of water being roughly at 0 °C and its boiling point at 100 °C at one standard atmosphere (1 atm = 1013.5 hPa). Until 1948, the unit was known as <i>centigrade</i> - from Latin <i>centum</i> (100) and <i>gradus</i> (steps). In meteorology and everyday life the Celsius scale is very convenient for expressing temperatures because its numbers can be an easy indicator for the formation of black ice and snow.
kk: 1742 жылы алғашқы шкаланы ойлап тапқан астроном Андерс Цельсийдің құрметіне аталған Цельсий шкаласы халықаралық стандартты бірлік болып табылады және қазіргі уақытта Кельвин шкаласы арқылы анықталады. 0 °C мәні 273,15 K-ге тең және температураның 1 °C айырмашылығы дәл 1 K айырмашылығымен бірдей. Ол судың қату нүктесі шамамен 0 °C, ал қайнау нүктесі бір стандартты атмосферада (1 атм = 1013,5 гПа) 100 °C болатынымен анықталады. 1948 жылға дейін бұл бірлік <i>centigrade</i> (жүз градустық) — латынның <i>centum</i> (100) және <i>gradus</i> (қадам) сөздерінен аталған. Метеорологияда және күнделікті өмірде Цельсий шкаласы температураны көрсету үшін өте ыңғайлы, себебі оның сандары көктайғақ пен қардың пайда болуының оңай көрсеткіші бола алады.
vi: Được đặt theo tên nhà thiên văn học Anders độ C, người đã phát minh ra thang đo ban đầu vào năm 1742, thang đo độ C là đơn vị tiêu chuẩn quốc tế và ngày nay được định nghĩa bằng thang đo Kelvin. 0 °C tương đương với 273,15 K và chênh lệch nhiệt độ 1 °C hoàn toàn giống với chênh lệch 1 K. Nó được xác định với điểm nóng chảy của nước xấp xỉ bằng 0 °C và điểm sôi của nó ở 100 °C ở một áp suất khí quyển tiêu chuẩn (1 atm = 1013,5 hPa). Cho đến năm 1948, đơn vị này được gọi là <i>centigrade</i> - từ tiếng Latin <i>centum</i> (100) và <i>gradus</i> (bước). Trong khí tượng học và cuộc sống hàng ngày, thang đo độ C rất thuận tiện cho việc biểu thị nhiệt độ vì các con số của nó có thể là chỉ báo dễ dàng cho sự hình thành băng đen và tuyết.
